In [1]:
import pickle
import pandas as pd

In [15]:
filename = '../../../output_data/sp/aa_1-573.pkl'

In [16]:
access_areas_df = pd.read_pickle(filename)

In [17]:
access_areas_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
0,12889,12834,235.0,34.784677,32.084755,2015-12-14 07:20:45,34.795442,32.082455,2015-12-14 07:16:50
1,12889,12841,175.0,34.787875,32.084074,2015-12-14 07:19:45,34.795442,32.082455,2015-12-14 07:16:50
2,12889,12889,0.0,34.795442,32.082455,2015-12-14 07:16:50,34.795442,32.082455,2015-12-14 07:16:50
3,12889,12894,337.0,34.778794,32.086040,2015-12-14 07:22:27,34.795442,32.082455,2015-12-14 07:16:50
4,12889,13296,1020.0,34.772032,32.065619,2015-12-14 07:33:50,34.795442,32.082455,2015-12-14 07:16:50

In [21]:
single_source_aa_df = access_areas_df[access_areas_df['stop_id_source'] == 14022]

In [22]:
single_source_aa_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
787,14022,12834,1725.0,34.784677,32.084755,2015-12-14 07:44:45,34.838972,32.069215,2015-12-14 07:16:00
788,14022,12841,1665.0,34.787875,32.084074,2015-12-14 07:43:45,34.838972,32.069215,2015-12-14 07:16:00
789,14022,12889,1490.0,34.795442,32.082455,2015-12-14 07:40:50,34.838972,32.069215,2015-12-14 07:16:00
790,14022,12893,1771.0,34.782893,32.075662,2015-12-14 07:54:31,34.838972,32.069215,2015-12-14 07:25:00
791,14022,12894,1827.0,34.778794,32.086040,2015-12-14 07:55:27,34.838972,32.069215,2015-12-14 07:25:00

In [20]:
single_source_aa_df.to_csv('../../../output_data/sp/csv/aa_5-556_from_stop_775.csv')

In [10]:
single_source_aa_df.shape

(15, 9)

In [11]:
single_source_aa_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
0,775,775,0.0,34.774177,32.017504,2015-12-14 07:10:36,34.774177,32.017504,2015-12-14 07:10:36
1,775,15564,790.0,34.805505,32.021799,2015-12-14 07:23:46,34.774177,32.017504,2015-12-14 07:10:36
2,775,21416,234.0,34.786839,32.017610,2015-12-14 07:14:30,34.774177,32.017504,2015-12-14 07:10:36
3,775,21475,848.0,34.802347,32.024450,2015-12-14 07:24:44,34.774177,32.017504,2015-12-14 07:10:36
4,775,21812,504.0,34.797698,32.016885,2015-12-14 07:19:00,34.774177,32.017504,2015-12-14 07:10:36